<?php

return [
    // 优惠券的状态
    'coupon_status' => [
        '1' => '未发放',        
        '2' => '已发放',
        '3' => '暂停发放',
        '4' => '已作废',
    ],

    // 优惠券的用户类型
    'user_type'   =>  [
        '1' => '所有用户',
        '2' => '首单新用户',
    ],

    // 广告的展示平台
    'show_platfrom'   =>  [
        '1' => '用户端',
        '2' => '骑手端',
        '3' => '商家端',
    ],

    // 广告的状态
    'advers_status'   =>  [
        '1' => '启用',
        '2' => '禁用',
    ],

    // 反馈建议的状态【反馈意见、意向商家、意向骑手】
    'dispose_status'   =>  [
        '1' => '未处理',
        '2' => '已处理',
    ],
    

];